enterprise/l10n_co_edi_pos/tests/expected_xmls/pos_order_sugar_taxes.xml

<Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2"
    xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2"
    xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2"
    xmlns:ext="urn:oasis:names:specification:ubl:schema:xsd:CommonExtensionComponents-2"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:sts="dian:gov:co:facturaelectronica:Structures-2-1"
    xmlns:xades="http://uri.etsi.org/01903/v1.3.2#"
    xmlns:xades141="http://uri.etsi.org/01903/v1.4.1#"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xsi:schemaLocation="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2     http://docs.oasis-open.org/ubl/os-UBL-2.1/xsd/maindoc/UBL-Invoice-2.1.xsd">
    <ext:UBLExtensions>___ignore___</ext:UBLExtensions>
    <cbc:UBLVersionID>UBL 2.1</cbc:UBLVersionID>
    <cbc:CustomizationID>10</cbc:CustomizationID>
    <cbc:ProfileID>DIAN 2.1: Factura Electrónica de Venta</cbc:ProfileID>
    <cbc:ProfileExecutionID>2</cbc:ProfileExecutionID>
    <cbc:ID>SETF990000000</cbc:ID>
    <cbc:UUID schemeID="2" schemeName="CUFE-SHA384">a83cf82aa9705acbb6050395cd213fd9ef4670b3d75d0e2a4c739944c5f19248482ff4a85ef1283624a0a0af206dd8fd</cbc:UUID>
    <cbc:IssueDate>2025-02-28</cbc:IssueDate>
    <cbc:IssueTime>19:00:00-05:00</cbc:IssueTime>
    <cbc:InvoiceTypeCode>01</cbc:InvoiceTypeCode>
    <cbc:Note>SETF9900000002025-02-2819:00:00-05:005.00010.25040.00030.002563.251018419008222222222222dummy_journal_technical_key2</cbc:Note>
    <cbc:DocumentCurrencyCode listAgencyID="6"
        listAgencyName="United Nations Economic Commission for Europe" listID="ISO 4217 Alpha">COP</cbc:DocumentCurrencyCode>
    <cbc:LineCountNumeric>2</cbc:LineCountNumeric>
    <cac:OrderReference>
        <cbc:ID>SETF990000000</cbc:ID>
    </cac:OrderReference>
    <cac:AccountingSupplierParty>
        <cbc:AdditionalAccountID>1</cbc:AdditionalAccountID>
        <cac:Party>
            <cbc:IndustryClassificationCode>0114</cbc:IndustryClassificationCode>
            <cac:PartyName>
                <cbc:Name>CO Company Test</cbc:Name>
            </cac:PartyName>
            <cac:PhysicalLocation>
                <cac:Address>
                    <cbc:ID>11001</cbc:ID>
                    <cbc:CityName>Bogotá D.C.</cbc:CityName>
                    <cbc:PostalZone>110110</cbc:PostalZone>
                    <cbc:CountrySubentity>Bogotá</cbc:CountrySubentity>
                    <cbc:CountrySubentityCode>11</cbc:CountrySubentityCode>
                    <cac:AddressLine>
                        <cbc:Line>CL 12A</cbc:Line>
                    </cac:AddressLine>
                    <cac:Country>
                        <cbc:IdentificationCode>CO</cbc:IdentificationCode>
                        <cbc:Name languageID="es">Colombia</cbc:Name>
                    </cac:Country>
                </cac:Address>
            </cac:PhysicalLocation>
            <cac:PartyTaxScheme>
                <cbc:RegistrationName>CO Company Test</cbc:RegistrationName>
                <cbc:CompanyID schemeName="31"
                    schemeAgencyName="CO, DIAN (Dirección de Impuestos y Aduanas Nacionales)"
                    schemeAgencyID="195" schemeID="5">1018419008</cbc:CompanyID>
                <cbc:TaxLevelCode>O-47</cbc:TaxLevelCode>
                <cac:RegistrationAddress>
                    <cbc:ID>11001</cbc:ID>
                    <cbc:CityName>Bogotá D.C.</cbc:CityName>
                    <cbc:PostalZone>110110</cbc:PostalZone>
                    <cbc:CountrySubentity>Bogotá</cbc:CountrySubentity>
                    <cbc:CountrySubentityCode>11</cbc:CountrySubentityCode>
                    <cac:AddressLine>
                        <cbc:Line>CL 12A</cbc:Line>
                    </cac:AddressLine>
                    <cac:Country>
                        <cbc:IdentificationCode>CO</cbc:IdentificationCode>
                        <cbc:Name languageID="es">Colombia</cbc:Name>
                    </cac:Country>
                </cac:RegistrationAddress>
                <cac:TaxScheme>
                    <cbc:ID>01</cbc:ID>
                    <cbc:Name>IVA</cbc:Name>
                </cac:TaxScheme>
            </cac:PartyTaxScheme>
            <cac:PartyLegalEntity>
                <cbc:RegistrationName>CO Company Test</cbc:RegistrationName>
                <cbc:CompanyID schemeName="31"
                    schemeAgencyName="CO, DIAN (Dirección de Impuestos y Aduanas Nacionales)"
                    schemeAgencyID="195" schemeID="5">1018419008</cbc:CompanyID>
                <cac:CorporateRegistrationScheme>
                    <cbc:ID>SETF</cbc:ID>
                    <cbc:Name>1018419008</cbc:Name>
                </cac:CorporateRegistrationScheme>
            </cac:PartyLegalEntity>
            <cac:Contact>
                <cbc:Name>CO Company Test</cbc:Name>
            </cac:Contact>
        </cac:Party>
    </cac:AccountingSupplierParty>
    <cac:AccountingCustomerParty>
        <cbc:AdditionalAccountID>2</cbc:AdditionalAccountID>
        <cac:Party>
            <cac:PartyIdentification>
                <cbc:ID schemeName="13">222222222222</cbc:ID>
            </cac:PartyIdentification>
            <cac:PartyName>
                <cbc:Name>Consumidor Final</cbc:Name>
            </cac:PartyName>
            <cac:PartyTaxScheme>
                <cbc:RegistrationName>Consumidor Final</cbc:RegistrationName>
                <cbc:CompanyID schemeName="13"
                    schemeAgencyName="CO, DIAN (Dirección de Impuestos y Aduanas Nacionales)"
                    schemeAgencyID="195">222222222222</cbc:CompanyID>
                <cbc:TaxLevelCode>R-99-PN</cbc:TaxLevelCode>
                <cac:TaxScheme>
                    <cbc:ID>ZZ</cbc:ID>
                    <cbc:Name>No aplica</cbc:Name>
                </cac:TaxScheme>
            </cac:PartyTaxScheme>
        </cac:Party>
    </cac:AccountingCustomerParty>
    <cac:PaymentMeans>
        <cbc:ID>1</cbc:ID>
        <cbc:PaymentMeansCode>2</cbc:PaymentMeansCode>
        <cbc:PaymentDueDate>2025-03-01</cbc:PaymentDueDate>
        <cbc:PaymentID>2025-03-01 00:00:00</cbc:PaymentID>
    </cac:PaymentMeans>
    <cac:PrepaidPayment>
        <cbc:ID>2025-03-01 00:00:00</cbc:ID>
        <cbc:PaidAmount currencyID="COP">2563.25</cbc:PaidAmount>
        <cbc:ReceivedDate>2025-03-01</cbc:ReceivedDate>
    </cac:PrepaidPayment>
    <cac:TaxTotal>
        <cbc:TaxAmount currencyID="COP">0.25</cbc:TaxAmount>
        <cac:TaxSubtotal>
            <cbc:TaxableAmount currencyID="COP">5.00</cbc:TaxableAmount>
            <cbc:TaxAmount currencyID="COP">0.25</cbc:TaxAmount>
            <cac:TaxCategory>
                <cbc:Percent>5.00</cbc:Percent>
                <cac:TaxScheme>
                    <cbc:ID>01</cbc:ID>
                    <cbc:Name>IVA</cbc:Name>
                </cac:TaxScheme>
            </cac:TaxCategory>
        </cac:TaxSubtotal>
    </cac:TaxTotal>
    <cac:TaxTotal>
        <cbc:TaxAmount currencyID="COP">2558.00</cbc:TaxAmount>
        <cac:TaxSubtotal>
            <cbc:TaxAmount currencyID="COP">2450.00</cbc:TaxAmount>
            <cbc:BaseUnitMeasure unitCode="ML">7000.0</cbc:BaseUnitMeasure>
            <cbc:PerUnitAmount currencyID="COP">35.00</cbc:PerUnitAmount>
            <cac:TaxCategory>
                <cac:TaxScheme>
                    <cbc:ID>34</cbc:ID>
                    <cbc:Name>IBUA</cbc:Name>
                </cac:TaxScheme>
            </cac:TaxCategory>
        </cac:TaxSubtotal>
        <cac:TaxSubtotal>
            <cbc:TaxAmount currencyID="COP">108.00</cbc:TaxAmount>
            <cbc:BaseUnitMeasure unitCode="ML">300.0</cbc:BaseUnitMeasure>
            <cbc:PerUnitAmount currencyID="COP">36.00</cbc:PerUnitAmount>
            <cac:TaxCategory>
                <cac:TaxScheme>
                    <cbc:ID>34</cbc:ID>
                    <cbc:Name>IBUA</cbc:Name>
                </cac:TaxScheme>
            </cac:TaxCategory>
        </cac:TaxSubtotal>
    </cac:TaxTotal>
    <cac:LegalMonetaryTotal>
        <cbc:LineExtensionAmount currencyID="COP">5.00</cbc:LineExtensionAmount>
        <cbc:TaxExclusiveAmount currencyID="COP">5.00</cbc:TaxExclusiveAmount>
        <cbc:TaxInclusiveAmount currencyID="COP">2563.25</cbc:TaxInclusiveAmount>
        <cbc:PrepaidAmount currencyID="COP">2563.25</cbc:PrepaidAmount>
        <cbc:PayableAmount currencyID="COP">2563.25</cbc:PayableAmount>
    </cac:LegalMonetaryTotal>
    <cac:InvoiceLine>
        <cbc:ID>1</cbc:ID>
        <cbc:InvoicedQuantity unitCode="94">2.0</cbc:InvoicedQuantity>
        <cbc:LineExtensionAmount currencyID="COP">2.00</cbc:LineExtensionAmount>
        <cac:TaxTotal>
            <cbc:TaxAmount currencyID="COP">0.10</cbc:TaxAmount>
            <cac:TaxSubtotal>
                <cbc:TaxableAmount currencyID="COP">2.00</cbc:TaxableAmount>
                <cbc:TaxAmount currencyID="COP">0.10</cbc:TaxAmount>
                <cac:TaxCategory>
                    <cbc:Percent>5.00</cbc:Percent>
                    <cac:TaxScheme>
                        <cbc:ID>01</cbc:ID>
                        <cbc:Name>IVA</cbc:Name>
                    </cac:TaxScheme>
                </cac:TaxCategory>
            </cac:TaxSubtotal>
        </cac:TaxTotal>
        <cac:TaxTotal>
            <cbc:TaxAmount currencyID="COP">2450.00</cbc:TaxAmount>
            <cac:TaxSubtotal>
                <cbc:TaxAmount currencyID="COP">2450.00</cbc:TaxAmount>
                <cbc:BaseUnitMeasure unitCode="ML">7000.0</cbc:BaseUnitMeasure>
                <cbc:PerUnitAmount currencyID="COP">35.00</cbc:PerUnitAmount>
                <cac:TaxCategory>
                    <cac:TaxScheme>
                        <cbc:ID>34</cbc:ID>
                        <cbc:Name>IBUA</cbc:Name>
                    </cac:TaxScheme>
                </cac:TaxCategory>
            </cac:TaxSubtotal>
        </cac:TaxTotal>
        <cac:Item>
            <cbc:Description>Coca cola 3.5L</cbc:Description>
            <cbc:Name>Coca cola 3.5L</cbc:Name>
            <cac:SellersItemIdentification>
                <cbc:ID>P1111</cbc:ID>
            </cac:SellersItemIdentification>
            <cac:StandardItemIdentification>
                <cbc:ID schemeID="999" schemeName="Estándar de adopción del contribuyente">P1111</cbc:ID>
            </cac:StandardItemIdentification>
        </cac:Item>
        <cac:Price>
            <cbc:PriceAmount currencyID="COP">1.0</cbc:PriceAmount>
            <cbc:BaseQuantity unitCode="94">2.0</cbc:BaseQuantity>
        </cac:Price>
    </cac:InvoiceLine>
    <cac:InvoiceLine>
        <cbc:ID>2</cbc:ID>
        <cbc:InvoicedQuantity unitCode="94">3.0</cbc:InvoicedQuantity>
        <cbc:LineExtensionAmount currencyID="COP">3.00</cbc:LineExtensionAmount>
        <cac:TaxTotal>
            <cbc:TaxAmount currencyID="COP">0.15</cbc:TaxAmount>
            <cac:TaxSubtotal>
                <cbc:TaxableAmount currencyID="COP">3.00</cbc:TaxableAmount>
                <cbc:TaxAmount currencyID="COP">0.15</cbc:TaxAmount>
                <cac:TaxCategory>
                    <cbc:Percent>5.00</cbc:Percent>
                    <cac:TaxScheme>
                        <cbc:ID>01</cbc:ID>
                        <cbc:Name>IVA</cbc:Name>
                    </cac:TaxScheme>
                </cac:TaxCategory>
            </cac:TaxSubtotal>
        </cac:TaxTotal>
        <cac:TaxTotal>
            <cbc:TaxAmount currencyID="COP">108.00</cbc:TaxAmount>
            <cac:TaxSubtotal>
                <cbc:TaxAmount currencyID="COP">108.00</cbc:TaxAmount>
                <cbc:BaseUnitMeasure unitCode="ML">300.0</cbc:BaseUnitMeasure>
                <cbc:PerUnitAmount currencyID="COP">36.00</cbc:PerUnitAmount>
                <cac:TaxCategory>
                    <cac:TaxScheme>
                        <cbc:ID>34</cbc:ID>
                        <cbc:Name>IBUA</cbc:Name>
                    </cac:TaxScheme>
                </cac:TaxCategory>
            </cac:TaxSubtotal>
        </cac:TaxTotal>
        <cac:Item>
            <cbc:Description>Sprite 100mL</cbc:Description>
            <cbc:Name>Sprite 100mL</cbc:Name>
            <cac:SellersItemIdentification>
                <cbc:ID>P2222</cbc:ID>
            </cac:SellersItemIdentification>
            <cac:StandardItemIdentification>
                <cbc:ID schemeID="999" schemeName="Estándar de adopción del contribuyente">P2222</cbc:ID>
            </cac:StandardItemIdentification>
        </cac:Item>
        <cac:Price>
            <cbc:PriceAmount currencyID="COP">1.0</cbc:PriceAmount>
            <cbc:BaseQuantity unitCode="94">3.0</cbc:BaseQuantity>
        </cac:Price>
    </cac:InvoiceLine>
</Invoice>
